//Apiary Data

export const Apiarytypes = [
  'أساسي',
  'مهاجر',
  'ثابت',
  'أخرى'
];

export const sunExposures = [
  'مشمس',
  'ظليل جزئياً',
  'ظل',
  'أخرى'
];

//Hive: Colony Data
export const force = [
  "ضعيف جداً",
  "ضعيف",
  "معتدل",
  "قوي",
  "قوي جداً"
];
export const colors = ['أحمر', 'أزرق', 'أخضر', 'أصفر', 'برتقالي', 'بنفسجي', 'وردي', 'بني', 'أبيض', 'أسود'];

export const Hivetypes = [
  'دادانت',
  'لانغستروث',
  'محلي c',
  'محلي S',
  'وطني',
  'صندوق طويل'
];

export const source = [
  'مستعمرة مشتراة',
  'نواة مشتراة',
  'حزمة مشتراة',
  'نواة ملتقطة',
  'مقطع',
  'فخ مخرج',
  'منقسم',
  'مستبدل'
];

export const purpose = [
  'إنتاج العسل',
  'إنتاج النحل',
  'تربية الملكات',
  'بحث وتطوير',
  'أخرى'
];

export const strength = [
  'ضعيف جداً',
  'ضعيف',
  'معتدل',
  'قوي',
  'قوي جداً'
];

export const ColonyTemperament = [
  'عدواني',
  'عصبي',
  'هادئ'
];

//Hive: Queen Data

export const status = ['مقبولة', 'خلايا ملكية', 'عذراء', 'مخصبة']; 

export const queen_state = [
  'خلايا مكشوفة',
  'خلايا مغطاة',
  'ناشئة',
  'مزوجة',
  'ناضجة',
  'قديمة',
  'غير معروفة'
];  

export const race = [
  'نحلة شمال أفريقيا الوسطى',
  'نحلة الصحراء',
  'نحلة الأطلس',
  'نحلة كارنيكا',
  'نحلة إيطالية'
];

export const queenColors = ['أحمر', 'أزرق', 'أخضر', 'أصفر', 'أبيض'];

export const queen_origin = ['مشتراة', 'مصنعة', 'طائفة ملتقطة', 'أخرى'];

export const queen_cells = ['لا شيء', 'تطريد', 'استبدال', 'طارئ'];

export const temperament = [
  "عدوانية",
  "عصبية",
  "هادئة",
];


//Inspection Data
export const brood = [
  "منتظمة",
  "تتوسط الإطار",
  "فسيفسائية",
  "غير منتظمة",
  "مفتوحة",
  "مغلقة"
];

export const malebrood = [
  "غير منتظمة",
  "منتظمة"
];

export const supplies = ["عسل", "حبوب اللقاح"];


export const units = [
  "لتر (L)",
  "كيلوغرام (kg)",
  "غرام (g)",
  "ملليلتر (ml)"
];

export const diseases = [
  'أكاروس',
  'تعفن الحضنة الأمريكي',
  'النحل الأفريقي',
  'تعفن الحضنة الأمريكي',
  'الحيوانات',
  'مرض الطباشير',
  'حضنة باردة',
  'متلازمة انهيار المستعمرات (CCD)',
  'إسهال النحل',
  'تعفن الحضنة الأوروبي',
  'عاملات وضع البيض',
  'نوزيما',
  'خسائر بسبب المبيدات',
  'بدون ملكة',
  'خنفساء صغيرة في الخلية',
  'تعفن الحجر',
  'تروبيلايلاپس',
  'فاروا',
  'دبابير',
  'عثة الشمع',
  'أخرى'
];

export const treatments = [
  'إضافة مبيد الأكاروس',
  'إزالة مبيد الأكاروس',
  'أبيغارد',
  'أبيستان',
  'أبيفار',
  'شيك مايت',
  'حمض الفورميك',
  'لوحات فورميك برو',
  'فوماغيلين-ب',
  'إضافة مبيد الحشرات',
  'إزالة مبيد الحشرات',
  'أخرى',
  'حمض الأوكساليك',
  'غبار السكر',
  'تيراميسين',
  'ثيمول',
  'تايلوسين'
];
export const doses = ["قطرات", "ميليغرام", "غرامات", "ميليلتر"];

export const HoneyPollenHarvest = ["منخفض", "متوسط", "مرتفع"];
export const options = [
  { name: "حضنة مفتوحة", requiresNumberInput: true },
  { name: "حضنة مغلقة", requiresNumberInput: true },
  { name: "إطار عسل", requiresNumberInput: true },
  { name: "إطار حبوب اللقاح", requiresNumberInput: true },
  { name: "شمع مشمع", requiresNumberInput: true },
  { name: "قرص عسل", requiresNumberInput: true }
];

//Harvest Data  

export const HarvestProducts = [
  "عسل",           
  "حبوب اللقاح",    
  "شمع النحل",       
  "العكبر",       
  "الهلام الملكي",   
  "خبز النحل",     
  "سم النحل"      
];

export const HarvestSeasons = [
  "الربيع",
  "الصيف",
  "الخريف",
  "الشتاء"
];

export const HarvestMethods = [
  "الاستخراج اليدوي",
  "الاستخراج بالطرد المركزي",
  "الجمع اليدوي",
  "الجمع الميكانيكي",
  "الجمع باستخدام المكنسة",
  "الجمع بالحك"
];

//Task Data
export const taskpriority = ['منخفض', 'مرتفع', 'عادي', 'حاسم'];


//Finance Data
export const IncomeCategory = [
 "عسل",          
"حبوب اللقاح",  
"شمع النحل",    
"العكبر",     
"الهلام الملكي",  
"خبز النحل",   
"سم النحل" 
];
export const ExpenseCategory = ['معدات', 'طعام', 'خلايا نحل', 'أدوية', 'أدوات', 'نقل'];



